{"ID":31970,"Author":{"Name":"pauldgifford","ID":0,"FullName":"","Gravatar":"0e7bce267c4409e465503ebb5164696d"},"Title":"VMware AppCatalyst Lab Installer","Description":"\u003cdiv class=\"content\"\u003e\u003cp\u003eVMware AppCatalyst is an API and Command Line Interface (CLI)-driven desktop hypervisor for MacOS that is purpose-built for developers, with the goal of bringing the datacenter to the desktop. Currently a technology preview, VMware AppCatalyst offers developers a fast and easy way to replicate a private cloud locally on their desktop for building and testing containerized and microservices-based applications. The tool features Project Photon, an open source minimal Linux container host, Docker Machine and integration with Vagrant.\u003c/p\u003e\n\n\u003cp\u003eInstalling VMware AppCatalyst itself is very simple and easy to do.  Since AppCatalyst is focused on the command line driven developer, I figured I would create an install script to stand up a complete Container Lab based on VMware AppCatalyst with the ability to leverage Docker Machine, Vagrant, Ansible and Packer. \u003c/p\u003e\n\n\u003cp\u003eInstall Brew \u003cbr/\u003e\nInstall Ansible\u003cbr/\u003e\nInstall Packer\u003cbr/\u003e\nInstall VMware AppCatalyst\u003cbr/\u003e\nInstall Docker Client\u003cbr/\u003e\nInstall Docker Machine (with AppCatalyst driver)\u003cbr/\u003e\nInstall Vagrant\u003cbr/\u003e\nInstall Vagrant AppCatalyst Plugin\u003cbr/\u003e\nInstall Vagrant Photon Plugin\u003c/p\u003e\n\n\u003cp\u003ePrerequisites:\u003cbr/\u003e\nOSX Yosemite or El Capitan \u003cbr/\u003e\nTerminal\u003cbr/\u003e\nInternet Access\u003c/p\u003e\n\n\u003cp\u003eThe AppCatalyst Lab Install can be found here on github (\u003ca href=\"https://github.com/paulgifford/appcatalystlab\"\u003ehttps://github.com/paulgifford/appcatalystlab\u003c/a\u003e), use the command below in Mac OSX terminal grab it with this:\u003c/p\u003e\n\n\u003cp\u003ecurl -O \u003ca href=\"https://raw.githubusercontent.com/paulgifford/appcatalystlab/master/appcatalyst-lab.sh\"\u003ehttps://raw.githubusercontent.com/paulgifford/appcatalystlab/master/appcatalyst-lab.sh\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eDisclaimer: Use at your own risk, this has been tested on default installs of OS X Yosemite and El Capitan without any customizations.This has not been tested on the Beta or Developer Previews from Apple.\u003cbr/\u003e\nIn future posts I will leverage this lab as a base to examine use cases leveraging AppCatalyst and numerous variations of Docker Machine, Vagrant, Ansible and Packer. Stay tuned for more posts.\u003c/p\u003e\n\u003c/div\u003e","Time":"2015-12-16T19:32:03Z","Tags":["OS X","fish","xterm-256color"]}